"use strict";
/**
Часы показывают h часы, m минуты и s секунды после полуночи.
Ваша задача — написать функцию, которая возвращает время с полуночи в миллисекундах.

Пример:
h = 0
m = 1
s = 1

result = 61000
Входные ограничения:

0 <= h <= 23
0 <= m <= 59
0 <= s <= 59
 */

function past(h, m, s) {
    //#Happy Coding! ^_^
    return h * 60 * 60 * 1000 + m * 60 * 1000 + s * 1000;
}

console.log(past(0, 1, 1)); // 61000
console.log(past(1, 1, 1)); // 3661000
console.log(past(0, 0, 0)); // 0
console.log(past(1, 0, 1)); // 3601000
console.log(past(1, 0, 0)); // 3600000
